{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1e6773d5",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "\n",
    "# Use the export domain for automated downloads\n",
    "remote_pdf_url = \"https://export.arxiv.org/pdf/1709.00666.pdf\"\n",
    "pdf_filename = \"ch02-downloaded.pdf\"\n",
    "\n",
    "headers = {\n",
    "    \"User-Agent\": \"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36\"\n",
    "}\n",
    "\n",
    "response = requests.get(remote_pdf_url, headers=headers)\n",
    "\n",
    "if response.status_code == 200:\n",
    "    with open(pdf_filename, \"wb\") as pdf_file:\n",
    "        pdf_file.write(response.content)\n",
    "    print(\"Download successful!\")\n",
    "else:\n",
    "    print(f\"Failed to download pdf. Status code: {response.status_code}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "56026656",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pdfplumber\n",
    "\n",
    "text = \"\"\n",
    "\n",
    "with pdfplumber.open(pdf_filename) as pdf:\n",
    "    for page in pdf.pages:\n",
    "        text += page.extract_text()\n",
    "\n",
    "print(text[0:20])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8cd9a258",
   "metadata": {},
   "outputs": [],
   "source": [
    "from utils import chunk_text\n",
    "\n",
    "chunks = chunk_text(text, 500, 40)\n",
    "print(len(chunks))\n",
    "print(chunks[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "08e75f30",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "from openai import OpenAI\n",
    "\n",
    "# load env variables\n",
    "load_dotenv()\n",
    "\n",
    "OPEN_AI_KEY = os.getenv(\"OPENAI_API_KEY\")\n",
    "open_ai_client = OpenAI(api_key=OPEN_AI_KEY)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "47b9ad19",
   "metadata": {},
   "outputs": [],
   "source": [
    "def embed(texts):\n",
    "    response = open_ai_client.embeddings.create(\n",
    "        input=texts,\n",
    "        model='text-embedding-3-small'\n",
    "    )\n",
    "\n",
    "    return list(map(lambda n: n.embedding, response.data))\n",
    "\n",
    "embeddings = embed(chunks)\n",
    "\n",
    "print(embeddings[0][0:3])\n",
    "print(len(embeddings))\n",
    "print(len(embeddings[0]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "855f74dd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connected!\n"
     ]
    }
   ],
   "source": [
    "load_dotenv(override=True)\n",
    "\n",
    "neo4j_user = os.getenv(\"NEO4J_USER\")\n",
    "neo4j_pwd = os.getenv(\"NEO4J_PWD\")\n",
    "neo4j_uri = os.getenv(\"NEO4J_URI\")\n",
    "\n",
    "driver = GraphDatabase.driver(neo4j_uri, auth=(neo4j_user, neo4j_pwd))\n",
    "driver.verify_connectivity(database=\"153d5309\")\n",
    "print(\"Connected!\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "cfb1de05",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x11d83b4d0>, keys=[])"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "driver.execute_query(\"\"\"CREATE VECTOR INDEX pdf IF NOT EXISTS\n",
    "FOR (c:Chunk)\n",
    "ON c.embedding\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "b3fe0855",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[], summary=<neo4j._work.summary.ResultSummary object at 0x12e091310>, keys=[])"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_query = '''\n",
    "WITH $chunks as chunks, range(0, size($chunks)) AS index\n",
    "UNWIND index AS i\n",
    "WITH i, chunks[i] AS chunk, $embeddings[i] AS embedding\n",
    "MERGE (c:Chunk {index: i})\n",
    "SET c.text = chunk, c.embedding = embedding\n",
    "'''\n",
    "\n",
    "driver.execute_query(cypher_query, chunks=chunks, embeddings=embeddings)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "e17c6630",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Einstein’s Patents and Inventi\n",
      "[0.0237579345703125, -0.0224761962890625, -0.0145263671875]\n"
     ]
    }
   ],
   "source": [
    "records, _, _ = driver.execute_query(\"MATCH (c:Chunk) WHERE c.index = 0 RETURN c.embedding, c.text\")\n",
    "\n",
    "print(records[0][\"c.text\"][0:30])\n",
    "print(records[0][\"c.embedding\"][0:3])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "5188f509",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N01', status_description='warn: feature deprecated with replacement. db.index.vector.queryNodes is deprecated. It is replaced by SEARCH.', position=<SummaryInputPosition line=2, column=1, offset=1>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 1, 'line': 2, 'column': 1}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"\\nCALL db.index.vector.queryNodes('pdf', $k, $question_embedding) YIELD node AS hits, score\\nRETURN hits.text AS text, score, hits.index AS index\\n\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CH‐Switzerland\n",
      "Considering Einstein’s upbringing, his interest in inventions and patents was not unusual.\n",
      "Being a manufacturer’s son, Einstein grew upon in an environment of machines and instruments.\n",
      "When his father’s company obtained the contract to illuminate Munich city during beer festival, he\n",
      "was actively engaged in execution of the contract. In his ETH days Einstein was genuinely interested\n",
      "in experimental works. He wrote to his friend, “most of the time I worked in the physical laboratory,\n",
      "fascinated by the direct contact with observation.” Einstein's\n",
      "0.8111365437507629 42\n",
      "======\n",
      "Einstein\n",
      "left his job at the Patent office and joined the University of Zurich on October 15, 1909. Thereafter, he\n",
      "continued to rise in ladder. In 1911, he moved to Prague University as a full professor, a year later, he\n",
      "was appointed as full professor at ETH, Zurich, his alma‐mater. In 1914, he was appointed Director of\n",
      "the Kaiser Wilhelm Institute for Physics (1914–1932) and a professor at the Humboldt University of\n",
      "Berlin, with a special clause in his contract that freed him from teaching obligations. In the meantime,\n",
      "he was working for\n",
      "0.7978956699371338 31\n",
      "======\n",
      "Einstein’s life was rather featureless. He diligently worked at the patent office,\n",
      "played violin, discussed physics with his friends, write few not so interesting papers. Then in 1905, he\n",
      "took the academic world by surprise. In the annals of physics, the year 1905 is known as “annus\n",
      "mirabilis” or the year of miracle. Indeed, a miracle happened. Albert Einstein, barely 26 years old,\n",
      "sitting in an obscure Swiss patent office, wrote four papers, each of which produced some sort of\n",
      "revolution in Physics. The papers were published in a single\n",
      "0.7873311042785645 20\n",
      "======\n",
      "in nuances of machines and instruments. However, it must also be\n",
      "emphasized that his main occupation was theoretical physics. The inventions he worked upon were\n",
      "his diversions. In his unproductive times he used to work upon on solving mathematical problems (not\n",
      "related to his ongoing theoretical investigations) or took upon some practical problem. As shown in\n",
      "Table. 2, Einstein was involved in three major inventions; (i) refrigeration system with Leo Szilard, (ii)\n",
      "Sound reproduction system with Rudolf Goldschmidt and (iii) automatic camera\n",
      "0.7872222065925598 44\n",
      "======\n"
     ]
    }
   ],
   "source": [
    "question = \"At what time was Einstein really interested in experimental works?\"\n",
    "question_embedding = embed([question])[0]\n",
    "\n",
    "query = '''\n",
    "CALL db.index.vector.queryNodes('pdf', $k, $question_embedding) YIELD node AS hits, score\n",
    "RETURN hits.text AS text, score, hits.index AS index\n",
    "'''\n",
    "similar_records, _, _ = driver.execute_query(query, question_embedding=question_embedding, k=4)\n",
    "\n",
    "for record in similar_records:\n",
    "    print(record[\"text\"])\n",
    "    print(record[\"score\"], record[\"index\"])\n",
    "    print(\"======\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
